tests/Motivation-GC-1/DATA/sw/fio_output_1G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 1024MiB) test: (groupid=0, jobs=1): err= 0: pid=74640: Mon Feb 10 09:01:58 2025 write: IOPS=273k, BW=1066MiB/s (1117MB/s)(1024MiB/961msec); 0 zone resets clat (nsec): min=1878, max=1760.7k, avg=3449.60, stdev=8633.11 lat (nsec): min=1917, max=1760.7k, avg=3491.22, stdev=8633.79 clat percentiles (nsec): | 1.00th=[ 2192], 5.00th=[ 2416], 10.00th=[ 2512], 20.00th=[ 2672], | 30.00th=[ 2800], 40.00th=[ 2928], 50.00th=[ 3056], 60.00th=[ 3248], | 70.00th=[ 3536], 80.00th=[ 4256], 90.00th=[ 4640], 95.00th=[ 4896], | 99.00th=[ 6432], 99.50th=[ 7136], 99.90th=[19072], 99.95th=[20096], | 99.99th=[22656] bw ( MiB/s): min= 1059, max= 1059, per=99.41%, avg=1059.25, stdev= 0.00, samples=1 iops : min=271167, max=271167, avg=271167.00, stdev= 0.00, samples=1 lat (usec) : 2=0.09%, 4=75.55%, 10=24.09%, 20=0.22%, 50=0.05% lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01% cpu : usr=6.98%, sys=92.60%, ctx=2, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=1066MiB/s (1117MB/s), 1066MiB/s-1066MiB/s (1117MB/s-1117MB/s), io=1024MiB (1074MB), run=961-961msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%