tests/Motivation-GC-1/DATA/sw/fio_output_1G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 1024MiB) test: (groupid=0, jobs=1): err= 0: pid=971094: Sun Feb 9 14:50:09 2025 write: IOPS=230k, BW=897MiB/s (940MB/s)(1024MiB/1142msec); 0 zone resets clat (usec): min=2, max=1642, avg= 4.06, stdev= 7.92 lat (usec): min=2, max=1642, avg= 4.11, stdev= 7.92 clat percentiles (nsec): | 1.00th=[ 2768], 5.00th=[ 2960], 10.00th=[ 3088], 20.00th=[ 3280], | 30.00th=[ 3408], 40.00th=[ 3568], 50.00th=[ 3728], 60.00th=[ 3920], | 70.00th=[ 4448], 80.00th=[ 4896], 90.00th=[ 5216], 95.00th=[ 5536], | 99.00th=[ 6560], 99.50th=[ 6816], 99.90th=[ 7776], 99.95th=[ 8256], | 99.99th=[13376] bw ( KiB/s): min=915776, max=925400, per=100.00%, avg=920588.00, stdev=6805.20, samples=2 iops : min=228944, max=231350, avg=230147.00, stdev=1701.30, samples=2 lat (usec) : 4=62.77%, 10=37.22%, 20=0.01%, 50=0.01%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01% cpu : usr=9.73%, sys=89.92%, ctx=1, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=897MiB/s (940MB/s), 897MiB/s-897MiB/s (940MB/s-940MB/s), io=1024MiB (1074MB), run=1142-1142msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%