tests/Motivation-GC-1/DATA/sw/fio_output_2G
test: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 2048MiB) test: (groupid=0, jobs=1): err= 0: pid=971655: Sun Feb 9 14:50:20 2025 write: IOPS=238k, BW=930MiB/s (976MB/s)(2048MiB/2201msec); 0 zone resets clat (usec): min=2, max=3404, avg= 3.90, stdev=15.23 lat (usec): min=2, max=3404, avg= 3.95, stdev=15.23 clat percentiles (nsec): | 1.00th=[ 2576], 5.00th=[ 2800], 10.00th=[ 2928], 20.00th=[ 3088], | 30.00th=[ 3216], 40.00th=[ 3376], 50.00th=[ 3504], 60.00th=[ 3696], | 70.00th=[ 4016], 80.00th=[ 4704], 90.00th=[ 5088], 95.00th=[ 5344], | 99.00th=[ 6624], 99.50th=[ 7200], 99.90th=[ 8096], 99.95th=[ 8384], | 99.99th=[12480] bw ( KiB/s): min=940408, max=967776, per=100.00%, avg=955118.00, stdev=14040.29, samples=4 iops : min=235102, max=241944, avg=238779.50, stdev=3510.07, samples=4 lat (usec) : 4=69.57%, 10=30.42%, 20=0.01%, 50=0.01%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01%, 4=0.01% cpu : usr=11.05%, sys=88.77%, ctx=3, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=930MiB/s (976MB/s), 930MiB/s-930MiB/s (976MB/s-976MB/s), io=2048MiB (2147MB), run=2201-2201msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%